In [84]:
from pandas import *
t_data = read_csv("train.csv")
test = read_csv("test.csv")
t_data.head(10)
pi = test['PassengerId']

# Data Cleaning

In [85]:
t_data.drop(['Name','Ticket','PassengerId','Cabin','Embarked'],axis=1,inplace=True)

In [86]:
t_data.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0         0       3    male  22.0      1      0   7.2500
1         1       1  female  38.0      1      0  71.2833
2         1       3  female  26.0      0      0   7.9250
3         1       1  female  35.0      1      0  53.1000
4         0       3    male  35.0      0      0   8.0500

In [87]:
t_data.dropna(inplace=True)
t_data.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0         0       3    male  22.0      1      0   7.2500
1         1       1  female  38.0      1      0  71.2833
2         1       3  female  26.0      0      0   7.9250
3         1       1  female  35.0      1      0  53.1000
4         0       3    male  35.0      0      0   8.0500

In [88]:
t_data.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
dtype: int64

# Categorical Data Conversion

In [89]:
s = get_dummies(t_data['Sex'],drop_first=True)

In [90]:
t_data = concat([t_data,s],axis=1)

In [91]:
t_data.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare  male
0         0       3    male  22.0      1      0   7.2500     1
1         1       1  female  38.0      1      0  71.2833     0
2         1       3  female  26.0      0      0   7.9250     0
3         1       1  female  35.0      1      0  53.1000     0
4         0       3    male  35.0      0      0   8.0500     1

In [92]:
t_data = t_data.drop('Sex',axis=1)

In [93]:
t_data.head()

   Survived  Pclass   Age  SibSp  Parch     Fare  male
0         0       3  22.0      1      0   7.2500     1
1         1       1  38.0      1      0  71.2833     0
2         1       3  26.0      0      0   7.9250     0
3         1       1  35.0      1      0  53.1000     0
4         0       3  35.0      0      0   8.0500     1

In [94]:
y = t_data['Survived']
X = t_data.drop('Survived',axis=1)

# Model Selection and Model Training

In [95]:
# from sklearn.model_selection import train_test_split
# X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.3, random_state = 0)

from sklearn.linear_model import LogisticRegression
d = LogisticRegression()
d.fit(X, y)

C:\Users\Raj\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [96]:
# y_pred = d.predict(X_test)
# print(y_pred)

In [97]:
# from sklearn.metrics import accuracy_score
# accuracy_score(y_test,y_pred)

# Test Data Cleaning and processing

In [98]:
test.drop(['PassengerId','Name','Ticket','Cabin','Embarked'],axis=1,inplace=True)
test.isnull().sum()

Pclass     0
Sex        0
Age       86
SibSp      0
Parch      0
Fare       1
dtype: int64

In [99]:
test.head()

   Pclass     Sex   Age  SibSp  Parch     Fare
0       3    male  34.5      0      0   7.8292
1       3  female  47.0      1      0   7.0000
2       2    male  62.0      0      0   9.6875
3       3    male  27.0      0      0   8.6625
4       3  female  22.0      1      1  12.2875

In [100]:
s = get_dummies(test['Sex'],drop_first=True)
test = test.drop('Sex',axis=1)
test = concat([test,s],axis=1)

In [101]:
test.head()

   Pclass   Age  SibSp  Parch     Fare  male
0       3  34.5      0      0   7.8292     1
1       3  47.0      1      0   7.0000     0
2       2  62.0      0      0   9.6875     1
3       3  27.0      0      0   8.6625     1
4       3  22.0      1      1  12.2875     0

In [102]:
test['Age'] = test['Age'].fillna(34)
test['Fare'] = test['Fare'].fillna(8)
# test['Fare'].mean

In [103]:
test.isnull().sum()

Pclass    0
Age       0
SibSp     0
Parch     0
Fare      0
male      0
dtype: int64

# Predict Test Data

In [104]:
pred = d.predict(test)

In [105]:
print(pred)

[0 0 0 0 1 0 1 0 1 0 0 0 1 0 1 1 0 0 1 0 0 0 1 1 1 0 1 0 0 0 0 0 0 0 0 0 1
 1 0 0 0 0 0 1 1 0 0 0 1 1 0 0 1 1 0 0 0 0 0 1 0 0 0 1 1 1 1 0 0 1 1 0 1 0
 1 1 0 1 0 1 0 0 0 0 0 0 1 1 1 0 1 0 1 0 1 0 1 0 1 0 1 0 0 0 1 0 0 0 0 0 0
 1 1 1 1 0 0 1 0 1 1 0 1 0 0 1 0 0 0 0 0 0 1 0 0 0 0 0 1 0 0 1 0 0 0 0 0 0
 0 0 1 0 0 1 0 0 1 1 0 1 1 0 1 0 0 1 0 0 1 1 0 0 0 0 0 1 1 0 1 1 0 0 1 0 1
 0 1 0 0 0 0 0 0 0 0 0 1 1 0 1 1 0 1 1 0 0 1 0 1 0 0 0 0 1 0 0 1 0 1 0 1 0
 1 0 1 1 0 1 0 0 0 1 0 0 0 0 0 0 1 1 1 1 0 0 0 0 1 0 1 0 1 0 1 0 0 0 0 0 1
 0 0 0 1 1 0 0 0 0 1 0 0 0 1 0 0 1 0 0 0 0 1 0 1 1 1 0 0 1 0 0 0 1 0 0 0 0
 1 0 0 0 0 0 0 0 1 1 1 0 0 0 0 0 0 1 1 1 0 0 0 0 0 0 0 0 1 0 1 0 0 0 1 0 0
 1 0 0 0 0 0 0 0 0 0 1 0 1 0 1 0 1 1 0 0 0 1 0 1 0 0 1 0 1 1 0 1 0 0 1 1 0
 0 1 0 0 1 1 0 0 0 0 0 0 1 1 0 1 0 0 0 0 1 1 0 0 0 1 0 1 0 0 1 0 1 1 0 0 0
 0 1 1 1 1 1 0 1 0 0 0]

In [106]:
len(pred)

418

In [107]:
test.shape

(418, 6)

# Save Result for Submission

In [108]:
submission = DataFrame({'PassengerId':pi,'Survived':pred})

In [109]:
submission.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

In [110]:
filename = 'Titanic Predictions 2.csv'

submission.to_csv(filename,index=False)